/* automatically generated by rust-bindgen 0.59.2 */

pub const vnc_true: u32 = 1;
pub const vnc_false: u32 = 0;
pub const vnc_success: u32 = 1;
pub const vnc_failure: u32 = 0;
#[doc = " @name Common primitive types */"]
pub type vnc_int8_t = ::std::os::raw::c_schar;
pub type vnc_int16_t = ::std::os::raw::c_short;
pub type vnc_int32_t = ::std::os::raw::c_int;
pub type vnc_int64_t = ::std::os::raw::c_longlong;
pub type vnc_uint8_t = ::std::os::raw::c_uchar;
pub type vnc_uint16_t = ::std::os::raw::c_ushort;
pub type vnc_uint31_t = ::std::os::raw::c_uint;
pub type vnc_uint32_t = ::std::os::raw::c_uint;
pub type vnc_uint64_t = ::std::os::raw::c_ulonglong;
#[doc = " @name Boolean type"]
#[doc = " @details Note that #vnc_true and #vnc_false are guaranteed to be defined as"]
#[doc = " 1 and 0 respectively in all future versions of the SDK.  There is no need to"]
#[doc = " explicitly reference these constants, unless you prefer that coding style."]
pub type vnc_bool_t = ::std::os::raw::c_int;
#[doc = " @name Status type"]
#[doc = " @details Note that #vnc_success and #vnc_failure are guaranteed to be defined"]
#[doc = " as 1 and 0 respectively in all future versions of the SDK.  There is no need"]
#[doc = " to explicitly reference these constants, unless you prefer that coding style;"]
#[doc = " either of these is acceptable:"]
#[doc = ""]
#[doc = " @code"]
#[doc = " if (!vnc_Logger_createFileLogger(\"logfile.txt\"))"]
#[doc = "     handleError();"]
#[doc = " @endcode"]
#[doc = ""]

#[doc = " @see vnc_Server_setConnectionCallback()."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vnc_Server_ConnectionCallback {
    #[doc = " Notification that a connection has successfully started."]
    #[doc = ""]
    #[doc = " This callback is notified when a Viewer has successfully authenticated and"]
    #[doc = " been granted a set of session permissions."]
    #[doc = ""]
    #[doc = " It is optional to define a callback function of this type.  Note that this"]
    #[doc = " callback is the only way to obtain a pointer to the @ref vnc_Connection"]
    #[doc = " object identifying this Viewer, required by some method calls."]
    #[doc = ""]
    #[doc = " This @ref vnc_Connection object is guaranteed to be valid until"]
    #[doc = " vnc_Server_ConnectionCallback::connectionEnded notifies you that it has"]
    #[doc = " been destroyed."]
    #[doc = ""]
    #[doc = " The connection count, as returned by vnc_Server_getConnectionCount(), is"]
    #[doc = " incremented @em before this callback is called."]
    #[doc = ""]
    #[doc = " @param connection The new connection."]
    pub connectionStarted: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
        ),
    >,
    #[doc = " Notification that a connection has ended."]
    #[doc = ""]
    #[doc = " A callback of this type is made when a Viewer explicitly disconnects from"]
    #[doc = " the Server, or a VNC Cloud or other network error has occurred."]
    #[doc = ""]
    #[doc = " Note this callback function is called even if you call"]
    #[doc = " vnc_Server_disconnect() or vnc_Server_disconnectAll() to terminate"]
    #[doc = " connections yourself."]
    #[doc = ""]
    #[doc = " Only connections which have successfully authenticated and received a"]
    #[doc = " vnc_Server_ConnectionCallback::connectionStarted notification are notified"]
    #[doc = " throw this ended notification."]
    #[doc = ""]
    #[doc = " It is optional to define a callback function of this type, but note that"]
    #[doc = " memory corruption will occur if you call vnc_Server_disconnect() on a"]
    #[doc = " freed @ref vnc_Connection, so you must use this callback if you maintain a"]
    #[doc = " list of connected viewers."]
    #[doc = ""]
    #[doc = " The connection count, as returned by vnc_Server_getConnectionCount(), is"]
    #[doc = " decremented @em after this callback is called."]
    #[doc = ""]
    #[doc = " @param connection The viewer connection which has ended."]
    pub connectionEnded: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
        ),
    >,
}
#[test]
fn bindgen_test_layout_vnc_Server_ConnectionCallback() {
    assert_eq!(
        ::std::mem::size_of::<vnc_Server_ConnectionCallback>(),
        16usize,
        concat!("Size of: ", stringify!(vnc_Server_ConnectionCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<vnc_Server_ConnectionCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(vnc_Server_ConnectionCallback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_ConnectionCallback>())).connectionStarted as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_ConnectionCallback),
            "::",
            stringify!(connectionStarted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_ConnectionCallback>())).connectionEnded as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_ConnectionCallback),
            "::",
            stringify!(connectionEnded)
        )
    );
}
#[doc = " Callback receiving security-related notifications for a Server."]
#[doc = ""]
#[doc = " @see vnc_Server_setSecurityCallback()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vnc_Server_SecurityCallback {
    #[doc = " Verify a Viewer's cryptographic identity."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer makes a connection, but before"]
    #[doc = " authentication."]
    #[doc = ""]
    #[doc = " It is optional to define a callback function of this type.  Note that"]
    #[doc = " VNC Cloud mutually verifies peer identities for you, so this check"]
    #[doc = " is for peace-of-mind only (and only likely to be useful if you have"]
    #[doc = " out-of-band access to a list of all potential Viewer identities)."]
    #[doc = ""]
    #[doc = " @param connection The new connection.  Note that if the connection does not"]
    #[doc = "     subsequently authenticate itself, then the"]
    #[doc = "     vnc_Server_ConnectionCallback::connectionEnded notification will not be"]
    #[doc = "     called, therefore you should not cache or store the @ref vnc_Connection"]
    #[doc = "     pointer at this stage."]
    #[doc = " @param viewerHexFingerprint A human-readable hexadecimal representation"]
    #[doc = "     of a 2048-bit RSA public key hash."]
    #[doc = " @param viewerRsaPublic The Viewer's public key.  See"]
    #[doc = "     vnc_RsaKey_Callback::detailsReady for the format."]
    #[doc = ""]
    #[doc = " @return #vnc_true to continue the connection or #vnc_false to terminate it."]
    pub verifyPeer: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
            viewerHexFingerprint: *const ::std::os::raw::c_char,
            viewerRsaPublic: *const vnc_DataBuffer,
        ) -> vnc_bool_t,
    >,
    #[doc = " Decide if a connecting Viewer is required to provide a user name."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer makes a connection, after peer identity"]
    #[doc = " verification has succeeded."]
    #[doc = ""]
    #[doc = " It is optional to define a callback function of this type, but note that"]
    #[doc = " if you do not, a connecting Viewer is required to provide a user name."]
    #[doc = ""]
    #[doc = " In your implementation, you should return #vnc_false if there is no need"]
    #[doc = " for a Viewer to provide a user name, and #vnc_true if there is."]
    #[doc = ""]
    #[doc = " @param connection The incoming connection.  Note that if the connection"]
    #[doc = "     does not subsequently authenticate itself, then the"]
    #[doc = "     vnc_Server_ConnectionCallback::connectionEnded notification will not be"]
    #[doc = "     called, therefore you should not cache or store the @ref vnc_Connection"]
    #[doc = "     pointer at this stage."]
    #[doc = ""]
    #[doc = " @return #vnc_false if a user name is not required, else #vnc_true."]
    pub isUserNameRequired: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
        ) -> vnc_bool_t,
    >,
    #[doc = " Decide if a connecting Viewer is required to provide a password."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer makes a connection, after peer identity"]
    #[doc = " verification has succeeded."]
    #[doc = ""]
    #[doc = " It is optional to define a callback function of this type, but note that"]
    #[doc = " if you do not, a connecting Viewer is required to provide a password."]
    #[doc = ""]
    #[doc = " In your implementation, you should return #vnc_false if there is no need"]
    #[doc = " for a Viewer to provide a password, and #vnc_true if there is."]
    #[doc = ""]
    #[doc = " @param connection The incoming connection.  Note that if the connection"]
    #[doc = "     does not subsequently authenticate itself, then the"]
    #[doc = "     vnc_Server_ConnectionCallback::connectionEnded notification will not be"]
    #[doc = "     called, therefore you should not cache or store the @ref vnc_Connection"]
    #[doc = "     pointer at this stage."]
    #[doc = ""]
    #[doc = " @return #vnc_false if a password is not required, else #vnc_true."]
    pub isPasswordRequired: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
        ) -> vnc_bool_t,
    >,
    #[doc = " Authenticate credentials presented by a Viewer."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer has sent credentials to be"]
    #[doc = " authenticated, after the Server has requested the details returned by the"]
    #[doc = " vnc_Server_SecurityCallback::isUserNameRequired and"]
    #[doc = " vnc_Server_SecurityCallback::isPasswordRequired callbacks."]
    #[doc = ""]
    #[doc = " It is mandatory to define this callback function."]
    #[doc = ""]
    #[doc = " In your implementation, you should authenticate @p username and"]
    #[doc = " @p password, and either return 0 to terminate the"]
    #[doc = " connection, or any combination of the @ref vnc_Server_Permissions flags to"]
    #[doc = " simultaneously approve the connection and grant a set of session"]
    #[doc = " permissions."]
    #[doc = ""]
    #[doc = " Please see the <a href=\"http://www.securecoding.cert.org\">CERT Coding"]
    #[doc = " Standards</a> for guidelines on handling passwords in reusable memory, in"]
    #[doc = " particular sections MSC18-C and MEM03-C."]
    #[doc = ""]
    #[doc = " @param connection The incoming connection."]
    #[doc = " @param username The user name provided by the Viewer.  This is provided"]
    #[doc = "     according to whether vnc_Server_SecurityCallback::isUserNameRequired"]
    #[doc = "     requested it (provided by default)."]
    #[doc = " @param password The password provided by the Viewer.  This is provided"]
    #[doc = "     according to whether vnc_Server_SecurityCallback::isPasswordRequired"]
    #[doc = "     requested it (provided by default)."]
    #[doc = ""]
    #[doc = " @return Any combination of the @ref vnc_Server_Permissions flags, or 0"]
    #[doc = "     (no permissions) to reject the connection."]
    pub authenticateUser: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            connection: *mut vnc_Connection,
            username: *const ::std::os::raw::c_char,
            password: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_vnc_Server_SecurityCallback() {
    assert_eq!(
        ::std::mem::size_of::<vnc_Server_SecurityCallback>(),
        32usize,
        concat!("Size of: ", stringify!(vnc_Server_SecurityCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<vnc_Server_SecurityCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(vnc_Server_SecurityCallback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_SecurityCallback>())).verifyPeer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_SecurityCallback),
            "::",
            stringify!(verifyPeer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_SecurityCallback>())).isUserNameRequired as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_SecurityCallback),
            "::",
            stringify!(isUserNameRequired)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_SecurityCallback>())).isPasswordRequired as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_SecurityCallback),
            "::",
            stringify!(isPasswordRequired)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_SecurityCallback>())).authenticateUser as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_SecurityCallback),
            "::",
            stringify!(authenticateUser)
        )
    );
}
#[doc = " Callback for handling input events."]
#[doc = ""]
#[doc = " @see vnc_Server_setInputEventsCallback()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vnc_Server_InputEventsCallback {
    #[doc = " Handle pointer events manually."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer has sent pointer events"]
    #[doc = " to the server. Return false to have the Server handle the pointer"]
    #[doc = " event as normal, or true to indicate it has been handled and"]
    #[doc = " should therefore cancel the default handling."]
    #[doc = ""]
    #[doc = " @param x The X position of the pointer event."]
    #[doc = " @param y The Y position of the pointer event."]
    #[doc = " @param buttonMask Bitmask of which buttons are down on the pointing device."]
    #[doc = "                   The first bit is the main button, the second bit is the secondary button, etc ..."]
    #[doc = " @param isRelative #vnc_true if the (x,y) position is relative to the last pointer position"]
    #[doc = "                   #vnc_false if the position is absolute."]
    #[doc = ""]
    #[doc = " @return #vnc_true if the pointer-event is to be handled by the SDK caller (i.e. override the behaviour),"]
    #[doc = "         #vnc_false if the pointer-event is to be handled by the Server as normal (default behaviour)."]
    pub pointerEventCallback: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            x: ::std::os::raw::c_int,
            y: ::std::os::raw::c_int,
            buttonMask: ::std::os::raw::c_int,
            isRelative: vnc_bool_t,
        ) -> vnc_bool_t,
    >,
    #[doc = " Handle keypress events manually."]
    #[doc = ""]
    #[doc = " This callback is made when a Viewer has sent keypress events"]
    #[doc = " to the server. Return false to have the Server handle the keypress"]
    #[doc = " event as normal, or true to indicate it has been handled and"]
    #[doc = " should cancel the default handling."]
    #[doc = ""]
    #[doc = " @param key Key pressed from the Viewer. Expressed as an X11 keysym code. See keyboard.h."]
    #[doc = " @param down True if this is the \"down\" event, false if this is the \"up\" event."]
    #[doc = ""]
    #[doc = " @return #vnc_true if the keypress event is to be handled by the SDK caller (i.e. override the behaviour),"]
    #[doc = "         #vnc_false if the keypress event is to be handled by the Server as normal (default behaviour)."]
    pub keyEventCallback: ::std::option::Option<
        unsafe extern "C" fn(
            userData: *mut ::std::os::raw::c_void,
            server: *mut vnc_Server,
            key: ::std::os::raw::c_int,
            down: vnc_bool_t,
        ) -> vnc_bool_t,
    >,
}
#[test]
fn bindgen_test_layout_vnc_Server_InputEventsCallback() {
    assert_eq!(
        ::std::mem::size_of::<vnc_Server_InputEventsCallback>(),
        16usize,
        concat!("Size of: ", stringify!(vnc_Server_InputEventsCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<vnc_Server_InputEventsCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(vnc_Server_InputEventsCallback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_InputEventsCallback>())).pointerEventCallback
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_InputEventsCallback),
            "::",
            stringify!(pointerEventCallback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_InputEventsCallback>())).keyEventCallback as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_InputEventsCallback),
            "::",
            stringify!(keyEventCallback)
        )
    );
}
#[doc = " Callback receiving agent-related notifications for a Server."]
#[doc = ""]
#[doc = " @see vnc_Server_setAgentCallback()."]
#[doc = ""]
#[doc = " @since 1.1"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vnc_Server_AgentCallback {
    #[doc = " Notification that the agent has started."]
    #[doc = ""]
    #[doc = " Note that the agent is normally started automatically as soon as the server"]
    #[doc = " is created via vnc_Server_create() or vnc_Server_createService()."]
    #[doc = ""]
    #[doc = " This callback is optional."]
    pub agentStarted: ::std::option::Option<
        unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void, server: *mut vnc_Server),
    >,
    #[doc = " Notification that the agent has stopped."]
    #[doc = ""]
    #[doc = " This may indicate that the user has logged out or (on Linux) the X server"]
    #[doc = " has stopped."]
    #[doc = ""]
    #[doc = " This callback is optional."]
    pub agentStopped: ::std::option::Option<
        unsafe extern "C" fn(userData: *mut ::std::os::raw::c_void, server: *mut vnc_Server),
    >,
}
#[test]
fn bindgen_test_layout_vnc_Server_AgentCallback() {
    assert_eq!(
        ::std::mem::size_of::<vnc_Server_AgentCallback>(),
        16usize,
        concat!("Size of: ", stringify!(vnc_Server_AgentCallback))
    );
    assert_eq!(
        ::std::mem::align_of::<vnc_Server_AgentCallback>(),
        8usize,
        concat!("Alignment of ", stringify!(vnc_Server_AgentCallback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_AgentCallback>())).agentStarted as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_AgentCallback),
            "::",
            stringify!(agentStarted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vnc_Server_AgentCallback>())).agentStopped as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vnc_Server_AgentCallback),
            "::",
            stringify!(agentStopped)
        )
    );
}
extern "C" {
    #[doc = " Creates a Server.  Note only one @ref vnc_Server should exist in your"]
    #[doc = " application at a time."]
    #[doc = ""]
    #[doc = " The Server captures the current session, which may be switched-out or"]
    #[doc = " otherwise not visible on the console."]
    #[doc = ""]
    #[doc = " @param agentPath The full path to the @c vncagent executable, or NULL to"]
    #[doc = "     specify that @c vncagent is in the same directory as the app"]
    #[doc = "     binary at run-time.  If you provide a directory, the executable must be"]
    #[doc = "     called @c vncagent (@c vncagent.exe on Windows); if you have renamed"]
    #[doc = "     @c vncagent then the filename must be provided."]
    #[doc = ""]
    #[doc = " @return A new @ref vnc_Server or NULL on error, in which case call"]
